import os

def print_shifted_left(text, shift=3, mirai_shift=5):
    # Получаем ширину терминала
    columns = os.get_terminal_size().columns

    # Разбиваем текст на строки
    lines = text.split("\n")

    # Центрируем каждую строку и сдвигаем влево
    shifted_text = ""
    for line in lines:
        # Если это строка с "MIRAI", сдвигаем её чуть правее
        if "MIRAI" in line:
            shifted_text += line.center(columns - shift + mirai_shift) + "\n"
        else:
            shifted_text += line.center(columns - shift) + "\n"

    print(shifted_text)

def main():
    banner = """
        ▄▄▄▄███▄▄▄▄    ▄█     ▄████████    ▄████████  ▄█
      ▄██▀▀▀███▀▀▀██▄ ███    ███    ███   ███    ███ ███
       ███   ███   ███ ███▌   ███    ███   ███    ███ ███▌
       ███   ███   ███ ███▌  ▄███▄▄▄▄██▀   ███    ███ ███▌
       ███   ███   ███ ███▌ ▀▀███▀▀▀▀▀   ▀███████████ ███▌
       ███   ███   ███ ███  ▀███████████   ███    ███ ███
      ███   ███   ███ ███    ███    ███   ███    ███ ███
       ▀█   ███   █▀  █▀     ███    ███   ███    █▀  █▀
             ███    ███
    ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬
        Создано с любовью Telegram: @eucult
    ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬
    VERSION 1.0.0
    ╔════════════════════════════════════════════════════════════════════════════════╗
    ║ [1] Снос сессий(.session)  [7] Изменить био           [13] Спам в комментарии  ║
    ║ [2] Голосование в опросе   [8] Очистить чаты          [14] Спам в ЛС           ║
    ║ [3] Жалоба на юзернейм     [9] Приглашение из чата    [15] Статистика(номера)  ║
    ║                                                                                ║
    ║ [4] Жалоба на сообщение    [10] Присоединение к чату  [16] Статус аккаунтов    ║
    ║ [5] Изменение имени        [11] Спам                  [17] Реакция на пост/соо ║
    ║ [6] Изменение аватара      [12] Спам без триггеров    [18] Установить 2ФА(пар) ║
    ╚════════════════════════════════════════════════════════════════════════════════╝
    """
    
    # Вызов функции для печати баннера
    print_shifted_left(banner)

# Вызов main
main()
